    // Пробелы после знаков препинания
    text = text.replace(/(\S)(\s?)(\.|\,|\:|\;|\!|\?)([^\.|\,|\:|\;|\!|\?|»|”|’])/g, "$1$3 $4");        // Привет ,как дела
    text = text.replace(/(\S)(\s?)(\.|\,|\:|\;|\!|\?)[ ]?(\n|\u2028|\u2029)/g, "$1$3$4");               // Привет !
                                                                                                        // Как дела
    text = text.replace(/(\S)(\s?)(\.|\,|\:|\;|\!|\?)$/g, "$1$3");                                      // Привет ! (в конце строки)
    text = text.replace(/(\S)(\s?)(\.|\,|\:|\;|\!|\?)[ ]+([^\.|\,|\:|\;|\!|\?|»|”|’])/g, "$1$3 $4");    // Привет , как дела