    // Заменяет р. на ₽
    text = text.replace(/(\d ?)((руб)|(Руб)|(РУБ))\. *([0-9А-ЯЁ])/g, "$1\xA0₽. $6"); // В предложении
    text = text.replace(/(\d ?)((руб)|(Руб)|(РУБ))\. *([0-9A-Z])/g, "$1\xA0₽. $6");
    text = text.replace(/(\d ?)((руб)|(Руб)|(РУБ))\./g, "$1\xA0₽"); // Одинокий рубль без точки
    text = text.replace(/(\d ?)(р|Р)\. *([0-9А-ЯЁ])/g, "$1\xA0₽. $3"); // В предложении
    text = text.replace(/(\d ?)(р|Р)\. *([0-9A-Z])/g, "$1\xA0₽. $3");
    text = text.replace(/(\d ?)(р|Р)\./g, "$1\xA0₽"); // Одинокий рубль без точки